[Killed] ArrowFunction
src/main/pages/AdminJobsPage.jsx:175:48
   };
 
   // *** Record Common Stats job ***
-  const objectToAxiosParamsRecordCommonStats = () => ({
-    url: `/api/jobs/launch/recordcommonstats`,
-    method: "POST",
-  });
+  const objectToAxiosParamsRecordCommonStats = () => undefined;
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit a record common stats job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
