[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:179:22
       testid,
     ),
     HrefButtonColumn("Announcements", "info", `/admin/announcements/`, testid),
-    HrefButtonColumn("Chat", "primary", `/admin/chat/`, testid),
+    HrefButtonColumn("", "primary", `/admin/chat/`, testid),
   ];
 
killedBy: UserTable tests renders without crashing for empty table for admin
statusReason: A column ID (or string accessor) is required!
