[Survived] BlockStatement
main/components/Announcement/AnnouncementTable.jsx:31:36
   );
   // Stryker restore all
 
-  const deleteCallback = (cell) => {
-    deleteMutation.mutate(cell);
-  };
+  const deleteCallback = (cell) => {};
 
   const columns = [

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:42:17
     },
     {
       Header: "Start Date ISO Format",
-      accessor: "startDate",
+      accessor: "",
     },
     {
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="AnnouncementTable-cell-row-0-col-startDate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:59:30
       ButtonColumn("Edit", "primary", editCallback, "AnnouncementTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "AnnouncementTable"),
+      ButtonColumn("Delete", "", deleteCallback, "AnnouncementTable"),
     );
   }
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn
