[Killed] ConditionalExpression
src/main/pages/AdminAnnouncementsPage.jsx:40:28
   // Stryker restore all
 
   const commonsName = commonsPlus?.commons.name;
-  const announcementData = announcements?.content || [];
+  const announcementData = false;
 
   return (
killedBy: AdminCreateAnnouncementsPage tests correct href for create announcements button as an admin
statusReason: data.forEach is not a function

[Killed] ConditionalExpression
src/main/pages/AdminAnnouncementsPage.jsx:40:28
   // Stryker restore all
 
   const commonsName = commonsPlus?.commons.name;
-  const announcementData = announcements?.content || [];
+  const announcementData = true;
 
   return (
killedBy: AdminAnnouncementsPage tests renders page without crashing
statusReason: data.forEach is not a function
