[Killed] BlockStatement
main/components/Announcement/AnnouncementTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    if (commonsId) {
-      navigate(`/admin/announcements/${commonsId}/edit/${cell.row.values.id}`);
-    } else {
-      navigate(`/announcements/edit/${cell.row.values.id}`);
-    }
-  };
+  const editCallback = (cell) => {};
 
   const deleteMutation = useBackendMutation(
killedBy: AnnouncementTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/announcements/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementTable.jsx:20:9
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    if (commonsId) {
+    if (true) {
       navigate(`/admin/announcements/${commonsId}/edit/${cell.row.values.id}`);
     } else {
killedBy: AnnouncementTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/announcements/edit/1' ]

Received: 

  1st spy call:

  [
-   "/announcements/edit/1",

[Survived] ConditionalExpression
main/components/Announcement/AnnouncementTable.jsx:20:9
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    if (commonsId) {
+    if (false) {
       navigate(`/admin/announcements/${commonsId}/edit/${cell.row.values.id}`);
     } else {

[Killed] BlockStatement
main/components/Announcement/AnnouncementTable.jsx:22:12
   const editCallback = (cell) => {
     if (commonsId) {
       navigate(`/admin/announcements/${commonsId}/edit/${cell.row.values.id}`);
-    } else {
-      navigate(`/announcements/edit/${cell.row.values.id}`);
-    }
+    } else {}
   };
 
killedBy: AnnouncementTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/announcements/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ArrayDeclaration
main/components/Announcement/AnnouncementTable.jsx:30:5
   const deleteMutation = useBackendMutation(
     cellToAxiosParamsDelete,
     { onSuccess: onDeleteSuccess },
-    [`/api/announcements/getbycommonsid?commonsId=${commonsId}`],
+    [],
   );
 

[Survived] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:30:6
   const deleteMutation = useBackendMutation(
     cellToAxiosParamsDelete,
     { onSuccess: onDeleteSuccess },
-    [`/api/announcements/getbycommonsid?commonsId=${commonsId}`],
+    [``],
   );
 

[Killed] ObjectLiteral
main/components/Announcement/AnnouncementTable.jsx:42:5
       Header: "id",
       accessor: "id",
     },
-    {
-      Header: "Start Date ISO Format",
-      accessor: "startDate",
-    },
+    {},
     {
       Header: "End Date ISO Format",
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:43:15
       accessor: "id",
     },
     {
-      Header: "Start Date ISO Format",
+      Header: "",
       accessor: "startDate",
     },
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Start Date ISO Format. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ObjectLiteral
main/components/Announcement/AnnouncementTable.jsx:46:5
       Header: "Start Date ISO Format",
       accessor: "startDate",
     },
-    {
-      Header: "End Date ISO Format",
-      accessor: "endDate",
-    },
+    {},
     {
       Header: "Announcement",
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:47:15
       accessor: "startDate",
     },
     {
-      Header: "End Date ISO Format",
+      Header: "",
       accessor: "endDate",
     },
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: Unable to find an element with the text: End Date ISO Format. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] BlockStatement
main/components/Announcement/AnnouncementTable.jsx:56:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "AnnouncementTable"),
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "AnnouncementTable"),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="AnnouncementTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:58:28
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "AnnouncementTable"),
+      ButtonColumn("Edit", "", editCallback, "AnnouncementTable"),
     );
     columns.push(
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:58:53
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "AnnouncementTable"),
+      ButtonColumn("Edit", "primary", editCallback, ""),
     );
     columns.push(
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="AnnouncementTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:61:20
       ButtonColumn("Edit", "primary", editCallback, "AnnouncementTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "AnnouncementTable"),
+      ButtonColumn("", "danger", deleteCallback, "AnnouncementTable"),
     );
   }
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: A column ID (or string accessor) is required!
