[Killed] ObjectLiteral
src/main/pages/AdminAnnouncementsPage.jsx:19:15
     {
       method: "GET",
       url: "/api/commons/plus",
-      params: {
-        id: commonsId,
-      },
+      params: {},
     },
   );
killedBy: AdminAnnouncementsPage tests renders announcements with correct commons name
statusReason: Unable to find an element with the text: Announcements for Commons: Sample Commons. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Survived] ObjectLiteral
src/main/pages/AdminAnnouncementsPage.jsx:27:5
 
   const { data: announcements } = useBackend(
     [`/api/announcements/getbycommonsid?commonsId=${commonsId}`],
-    {
-      method: "GET",
-      url: "/api/announcements/getbycommonsid",
-      params: {
-        commonsId,
-      },
-    },
+    {},
     [],
   );

[Survived] StringLiteral
src/main/pages/AdminAnnouncementsPage.jsx:29:12
     [`/api/announcements/getbycommonsid?commonsId=${commonsId}`],
     {
       method: "GET",
-      url: "/api/announcements/getbycommonsid",
+      url: "",
       params: {
         commonsId,

[Survived] ObjectLiteral
src/main/pages/AdminAnnouncementsPage.jsx:30:15
     {
       method: "GET",
       url: "/api/announcements/getbycommonsid",
-      params: {
-        commonsId,
-      },
+      params: {},
     },
     [],

[Survived] OptionalChaining
src/main/pages/AdminAnnouncementsPage.jsx:55:31
 
             <AnnouncementTable
               announcements={
-                Array.isArray(announcements?.content)
+                Array.isArray(announcements.content)
                   ? announcements.content
                   : []
