[Survived] ArrayDeclaration
src/main/pages/AdminCreateAnnouncementsPage.jsx:13:5
   const navigate = useNavigate();
 
   const { data: commonsPlus } = useBackend(
-    [`/api/commons/plus?id=${commonsId}`],
+    [],
     {
       method: "GET",

[Killed] ObjectLiteral
src/main/pages/AdminCreateAnnouncementsPage.jsx:14:5
 
   const { data: commonsPlus } = useBackend(
     [`/api/commons/plus?id=${commonsId}`],
-    {
-      method: "GET",
-      url: "/api/commons/plus",
-      params: {
-        id: commonsId,
-      },
-    },
+    {},
   );
 
killedBy: AdminCreateAnnouncementsPage tests renders page without crashing
statusReason: Unable to find an element with the text: for Commons: Sample Commons. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/AdminCreateAnnouncementsPage.jsx:16:12
     [`/api/commons/plus?id=${commonsId}`],
     {
       method: "GET",
-      url: "/api/commons/plus",
+      url: "",
       params: {
         id: commonsId,
killedBy: AdminCreateAnnouncementsPage tests renders page without crashing
statusReason: Unable to find an element with the text: for Commons: Sample Commons. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
src/main/pages/AdminCreateAnnouncementsPage.jsx:24:5
   );
 
   const mutation = useBackendMutation(
-    (params) => ({
-      url: "/api/announcements/post",
-      method: "POST",
-      params,
-    }),
+    () => undefined,
     {
       onSuccess: () => {
killedBy: AdminCreateAnnouncementsPage tests submits create announcement with start and end dates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminCreateAnnouncementsPage.jsx:24:18
   );
 
   const mutation = useBackendMutation(
-    (params) => ({
-      url: "/api/announcements/post",
-      method: "POST",
-      params,
-    }),
+    (params) => ({}),
     {
       onSuccess: () => {
killedBy: AdminCreateAnnouncementsPage tests submits create announcement with start and end dates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminCreateAnnouncementsPage.jsx:26:15
   const mutation = useBackendMutation(
     (params) => ({
       url: "/api/announcements/post",
-      method: "POST",
+      method: "",
       params,
     }),
killedBy: AdminCreateAnnouncementsPage tests submits create announcement with start and end dates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.jsx:30:24
       params,
     }),
     {
-      onSuccess: () => {
-        toast("Announcement created");
-        navigate(`/admin/announcements/${commonsId}`);
-      },
+      onSuccess: () => {},
     },
   );
killedBy: AdminCreateAnnouncementsPage tests submits create announcement with start and end dates
statusReason: expected "spy" to be called with arguments: [ '/admin/announcements/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Survived] StringLiteral
src/main/pages/AdminCreateAnnouncementsPage.jsx:31:15
     }),
     {
       onSuccess: () => {
-        toast("Announcement created");
+        toast("");
         navigate(`/admin/announcements/${commonsId}`);
       },

[Survived] StringLiteral
src/main/pages/AdminCreateAnnouncementsPage.jsx:39:19
 
   const toBackendDate = (dateTimeLocal) => {
     const date = new Date(dateTimeLocal);
-    const days = ["Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"];
+    const days = ["", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"];
     const months = [
       "Jan",

[Survived] ArrayDeclaration
src/main/pages/AdminCreateAnnouncementsPage.jsx:39:18
 
   const toBackendDate = (dateTimeLocal) => {
     const date = new Date(dateTimeLocal);
-    const days = ["Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"];
+    const days = [];
     const months = [
       "Jan",

[Survived] StringLiteral
src/main/pages/AdminCreateAnnouncementsPage.jsx:44:7
       "Jan",
       "Feb",
       "Mar",
-      "Apr",
+      "",
       "May",
       "Jun",

[Survived] StringLiteral
src/main/pages/AdminCreateAnnouncementsPage.jsx:45:7
       "Feb",
       "Mar",
       "Apr",
-      "May",
+      "",
       "Jun",
       "Jul",

[Survived] StringLiteral
src/main/pages/AdminCreateAnnouncementsPage.jsx:49:7
       "Jun",
       "Jul",
       "Aug",
-      "Sep",
+      "",
       "Oct",
       "Nov",

[Survived] ArrowFunction
src/main/pages/AdminCreateAnnouncementsPage.jsx:55:17
       "Dec",
     ];
 
-    const pad = (n) => String(n).padStart(2, "0");
+    const pad = () => undefined;
     const timezone = date
       .toLocaleTimeString("en-us", { timeZoneName: "short" })

[Killed] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.jsx:68:34
     )}:00 ${timezone} ${date.getFullYear()}`;
   };
 
-  const submitAction = (data) => {
-    const params = {
-      commonsId: Number(commonsId),
-      announcementText: data.announcementText,
-      startDate: toBackendDate(data.startDate),
-    };
-
-    if (data.endDate) {
-      params.endDate = toBackendDate(data.endDate);
-    }
-
-    mutation.mutate(params);
-  };
+  const submitAction = (data) => {};
 
   const commonsName = commonsPlus?.commons.name;
killedBy: AdminCreateAnnouncementsPage tests submits create announcement with start and end dates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
src/main/pages/AdminCreateAnnouncementsPage.jsx:75:9
       startDate: toBackendDate(data.startDate),
     };
 
-    if (data.endDate) {
+    if (true) {
       params.endDate = toBackendDate(data.endDate);
     }
killedBy: AdminCreateAnnouncementsPage tests submits create announcement without end date
statusReason: expected { commonsId: 1, …(3) } to not have property "endDate"

[Killed] ConditionalExpression
src/main/pages/AdminCreateAnnouncementsPage.jsx:75:9
       startDate: toBackendDate(data.startDate),
     };
 
-    if (data.endDate) {
+    if (false) {
       params.endDate = toBackendDate(data.endDate);
     }
killedBy: AdminCreateAnnouncementsPage tests submits create announcement with start and end dates
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string
