[Survived] ArrayDeclaration
src/main/pages/AdminEditAnnouncementsPage.jsx:13:5
   const navigate = useNavigate();
 
   const { data: announcement } = useBackend(
-    [`/api/announcements/getbyid?id=${announcementId}`],
+    [],
     {
       method: "GET",

[Killed] ObjectLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:14:5
 
   const { data: announcement } = useBackend(
     [`/api/announcements/getbyid?id=${announcementId}`],
-    {
-      method: "GET",
-      url: "/api/announcements/getbyid",
-      params: {
-        id: announcementId,
-      },
-    },
+    {},
   );
 
killedBy: AdminEditAnnouncementsPage tests renders page and populates form
statusReason: Unable to find an element by: [data-testid="AnnouncementForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:16:12
     [`/api/announcements/getbyid?id=${announcementId}`],
     {
       method: "GET",
-      url: "/api/announcements/getbyid",
+      url: "",
       params: {
         id: announcementId,
killedBy: AdminEditAnnouncementsPage tests renders page and populates form
statusReason: Unable to find an element by: [data-testid="AnnouncementForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
src/main/pages/AdminEditAnnouncementsPage.jsx:24:5
   );
 
   const mutation = useBackendMutation(
-    (params) => ({
-      method: "PUT",
-      url: "/api/announcements/put",
-      params,
-    }),
+    () => undefined,
     {
       onSuccess: () => {
killedBy: AdminEditAnnouncementsPage tests submits edit announcement with start and end dates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:24:18
   );
 
   const mutation = useBackendMutation(
-    (params) => ({
-      method: "PUT",
-      url: "/api/announcements/put",
-      params,
-    }),
+    (params) => ({}),
     {
       onSuccess: () => {
killedBy: AdminEditAnnouncementsPage tests submits edit announcement with start and end dates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:29:5
       url: "/api/announcements/put",
       params,
     }),
-    {
-      onSuccess: () => {
-        toast("Announcement updated");
-        navigate(`/admin/announcements/${commonsId}`);
-      },
-    },
+    {},
   );
 
killedBy: AdminEditAnnouncementsPage tests submits edit announcement with start and end dates
statusReason: expected "spy" to be called with arguments: [ '/admin/announcements/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/main/pages/AdminEditAnnouncementsPage.jsx:30:24
       params,
     }),
     {
-      onSuccess: () => {
-        toast("Announcement updated");
-        navigate(`/admin/announcements/${commonsId}`);
-      },
+      onSuccess: () => {},
     },
   );
killedBy: AdminEditAnnouncementsPage tests submits edit announcement with start and end dates
statusReason: expected "spy" to be called with arguments: [ '/admin/announcements/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Survived] StringLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:39:47
 
   const toBackendDate = (dateTimeLocal) => {
     const date = new Date(dateTimeLocal);
-    const days = ["Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"];
+    const days = ["Sun", "Mon", "Tue", "Wed", "", "Fri", "Sat"];
     const months = [
       "Jan",

[Survived] ArrayDeclaration
src/main/pages/AdminEditAnnouncementsPage.jsx:40:20
   const toBackendDate = (dateTimeLocal) => {
     const date = new Date(dateTimeLocal);
     const days = ["Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"];
-    const months = [
-      "Jan",
-      "Feb",
-      "Mar",
-      "Apr",
-      "May",
-      "Jun",
-      "Jul",
-      "Aug",
-      "Sep",
-      "Oct",
-      "Nov",
-      "Dec",
-    ];
+    const months = [];
 
     const pad = (n) => String(n).padStart(2, "0");

[Killed] StringLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:57:27
 
     const pad = (n) => String(n).padStart(2, "0");
     const timezone = date
-      .toLocaleTimeString("en-us", { timeZoneName: "short" })
+      .toLocaleTimeString("", { timeZoneName: "short" })
       .split(" ")
       .pop();
killedBy: AdminEditAnnouncementsPage tests submits edit announcement with start and end dates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminEditAnnouncementsPage.jsx:68:44
     )}:00 ${timezone} ${date.getFullYear()}`;
   };
 
-  const toDateTimeLocal = (backendDate) => {
-    if (!backendDate) {
-      return "";
-    }
-
-    return backendDate.substring(0, 16);
-  };
+  const toDateTimeLocal = (backendDate) => {};
 
   const submitAction = (data) => {
killedBy: AdminEditAnnouncementsPage tests renders page and populates form
statusReason: expect(element).toHaveValue(2026-05-21T21:17)

Expected the element to have value:
  2026-05-21T21:17
Received:

[Killed] BooleanLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:69:9
   };
 
   const toDateTimeLocal = (backendDate) => {
-    if (!backendDate) {
+    if (backendDate) {
       return "";
     }
killedBy: AdminEditAnnouncementsPage tests renders page and populates form
statusReason: expect(element).toHaveValue(2026-05-21T21:17)

Expected the element to have value:
  2026-05-21T21:17
Received:

[Killed] ConditionalExpression
src/main/pages/AdminEditAnnouncementsPage.jsx:69:9
   };
 
   const toDateTimeLocal = (backendDate) => {
-    if (!backendDate) {
+    if (true) {
       return "";
     }
killedBy: AdminEditAnnouncementsPage tests renders page and populates form
statusReason: expect(element).toHaveValue(2026-05-21T21:17)

Expected the element to have value:
  2026-05-21T21:17
Received:

[Killed] MethodExpression
src/main/pages/AdminEditAnnouncementsPage.jsx:73:12
       return "";
     }
 
-    return backendDate.substring(0, 16);
+    return backendDate;
   };
 
killedBy: AdminEditAnnouncementsPage tests renders page and populates form
statusReason: expect(element).toHaveValue(2026-05-21T21:17)

Expected the element to have value:
  2026-05-21T21:17
Received:

[Killed] BlockStatement
src/main/pages/AdminEditAnnouncementsPage.jsx:76:34
     return backendDate.substring(0, 16);
   };
 
-  const submitAction = (data) => {
-    const params = {
-      id: Number(data.id),
-      commonsId: Number(commonsId),
-      announcementText: data.announcementText,
-      startDate: toBackendDate(data.startDate),
-    };
-
-    if (data.endDate) {
-      params.endDate = toBackendDate(data.endDate);
-    }
-
-    mutation.mutate(params);
-  };
+  const submitAction = (data) => {};
 
   const initialContents = announcement && {
killedBy: AdminEditAnnouncementsPage tests submits edit announcement with start and end dates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:77:20
   };
 
   const submitAction = (data) => {
-    const params = {
-      id: Number(data.id),
-      commonsId: Number(commonsId),
-      announcementText: data.announcementText,
-      startDate: toBackendDate(data.startDate),
-    };
+    const params = {};
 
     if (data.endDate) {
killedBy: AdminEditAnnouncementsPage tests submits edit announcement with start and end dates
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ConditionalExpression
src/main/pages/AdminEditAnnouncementsPage.jsx:91:27
     mutation.mutate(params);
   };
 
-  const initialContents = announcement && {
-    ...announcement,
-    startDate: toDateTimeLocal(announcement.startDate),
-    endDate: toDateTimeLocal(announcement.endDate),
-  };
+  const initialContents = true;
 
   return (
killedBy: AdminEditAnnouncementsPage tests renders page and populates form
statusReason: expect(element).toHaveValue(2)

Expected the element to have value:
  2
Received:

[Killed] LogicalOperator
src/main/pages/AdminEditAnnouncementsPage.jsx:91:27
     mutation.mutate(params);
   };
 
-  const initialContents = announcement && {
-    ...announcement,
-    startDate: toDateTimeLocal(announcement.startDate),
-    endDate: toDateTimeLocal(announcement.endDate),
-  };
+  const initialContents = announcement || {
+  ...announcement,
+  startDate: toDateTimeLocal(announcement.startDate),
+  endDate: toDateTimeLocal(announcement.endDate)
+};
 
   return (
killedBy: AdminEditAnnouncementsPage tests renders page and populates form
statusReason: Cannot read properties of undefined (reading 'startDate')

[Killed] ConditionalExpression
src/main/pages/AdminEditAnnouncementsPage.jsx:102:10
       <div className="pt-2">
         <h1>Edit Announcement</h1>
 
-        {initialContents && (
-          <AnnouncementForm
-            initialContents={initialContents}
-            submitAction={submitAction}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: AdminEditAnnouncementsPage tests renders page and populates form
statusReason: Unable to find an element by: [data-testid="AnnouncementForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/AdminEditAnnouncementsPage.jsx:102:10
       <div className="pt-2">
         <h1>Edit Announcement</h1>
 
-        {initialContents && (
-          <AnnouncementForm
-            initialContents={initialContents}
-            submitAction={submitAction}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: AdminEditAnnouncementsPage tests renders page and populates form
statusReason: Unable to find an element by: [data-testid="AnnouncementForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
