[Killed] StringLiteral
src/main/utils/announcementUtils.js:11:13
 export function cellToAxiosParamsDelete(cell) {
   return {
     url: "/api/announcements/delete",
-    method: "DELETE",
+    method: "",
     params: {
       id: cell.row.values.id,
killedBy: AnnouncementUtils cellToAxiosParamsDelete It returns the correct params
statusReason: expected { …(3) } to deeply equal { …(3) }
