[Killed] ObjectLiteral
src/main/pages/AdminCoursesIndexPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/course/all"],
-    { method: "GET", url: "/api/course/all" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: CoursesIndexPage tests renders three courses correctly for regular user
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
