[Killed] ArrowFunction
src/main/pages/AdminCoursesCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function CoursesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (course) => ({
-    url: "/api/course/post",
-    method: "POST",
-    params: {
-      code: course.code,
-      name: course.name,
-      term: course.term,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (course) => {
killedBy: CoursesCreatePage tests on submit, makes request to backend, and redirects to /course
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminCoursesCreatePage.jsx:8:44
 import { toast } from "react-toastify";
 
 export default function CoursesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (course) => ({
-    url: "/api/course/post",
-    method: "POST",
-    params: {
-      code: course.code,
-      name: course.name,
-      term: course.term,
-    },
-  });
+  const objectToAxiosParams = (course) => ({});
 
   const onSuccess = (course) => {
killedBy: CoursesCreatePage tests on submit, makes request to backend, and redirects to /course
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminCoursesCreatePage.jsx:10:13
 export default function CoursesCreatePage({ storybook = false }) {
   const objectToAxiosParams = (course) => ({
     url: "/api/course/post",
-    method: "POST",
+    method: "",
     params: {
       code: course.code,
killedBy: CoursesCreatePage tests on submit, makes request to backend, and redirects to /course
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminCoursesCreatePage.jsx:35:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/admin/createcourses" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: CoursesCreatePage tests on submit, makes request to backend, and redirects to /course
statusReason: expected "spy" to be called with arguments: [ { to: '/admin/createcourses' } ]

Number of calls: 0
