[Killed] ObjectLiteral
src/main/pages/AdminCoursesEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/course?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/course`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="CoursesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/AdminCoursesEditPage.jsx:21:12
     {
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
-      url: `/api/course`,
+      url: ``,
       params: {
         id,
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="CoursesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
src/main/pages/AdminCoursesEditPage.jsx:22:15
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/course`,
-      params: {
-        id,
-      },
+      params: {},
     },
   );
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="CoursesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
src/main/pages/AdminCoursesEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (course) => ({
-    url: "/api/course",
-    method: "PUT",
-    params: {
-      id: course.id,
-    },
-    data: {
-      code: course.code,
-      name: course.name,
-      term: course.term,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (course) => {
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminCoursesEditPage.jsx:29:10
   );
 
   const objectToAxiosPutParams = (course) => ({
-    url: "/api/course",
+    url: "",
     method: "PUT",
     params: {
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminCoursesEditPage.jsx:30:13
 
   const objectToAxiosPutParams = (course) => ({
     url: "/api/course",
-    method: "PUT",
+    method: "",
     params: {
       id: course.id,
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Course Updated - id: 17 code: MATH 4B",

[Killed] BlockStatement
src/main/pages/AdminCoursesEditPage.jsx:58:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/admin/editcourses/:id" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ { to: '/admin/editcourses/:id' } ]

Number of calls: 0
