[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:68:19
     matched = commonsforuser.some((com) => com.id === commonsPlus.commons.id);
   }
 
-  const allowed = commonsPlusExists && matched && !commonsPlus.commons.hidden;
+  const allowed = false;
   const notallowed = commonsPlusExists && !matched;
   const hidden = commonsPlusExists && commonsPlus.commons.hidden;
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="commonsPlay-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(\"/src/assets/PlayPageBackground.jpg\");"

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:68:19
     matched = commonsforuser.some((com) => com.id === commonsPlus.commons.id);
   }
 
-  const allowed = commonsPlusExists && matched && !commonsPlus.commons.hidden;
+  const allowed = true;
   const notallowed = commonsPlusExists && !matched;
   const hidden = commonsPlusExists && commonsPlus.commons.hidden;
killedBy: PlayPage tests cannot join hidden commons
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1
  class="animate-charcter"
  data-testid="commonsPlay-title"
>
  Your journey continues farmer

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:69:22
   }
 
   const allowed = commonsPlusExists && matched && !commonsPlus.commons.hidden;
-  const notallowed = commonsPlusExists && !matched;
+  const notallowed = false;
   const hidden = commonsPlusExists && commonsPlus.commons.hidden;
 
killedBy: PlayPage tests User that has not joined any commons is trying to access an unjoined common
statusReason: Unable to find an element with the text: You have yet to join this commons!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:69:22
   }
 
   const allowed = commonsPlusExists && matched && !commonsPlus.commons.hidden;
-  const notallowed = commonsPlusExists && !matched;
+  const notallowed = true;
   const hidden = commonsPlusExists && commonsPlus.commons.hidden;
 
killedBy: PlayPage tests User that has joined one commons is trying to access a joined common
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>
  You have yet to join this commons!
</h1> instead

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:70:18
 
   const allowed = commonsPlusExists && matched && !commonsPlus.commons.hidden;
   const notallowed = commonsPlusExists && !matched;
-  const hidden = commonsPlusExists && commonsPlus.commons.hidden;
+  const hidden = commonsPlusExists || commonsPlus.commons.hidden;
 
   // Stryker disable all
killedBy: PlayPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'commons')

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:70:18
 
   const allowed = commonsPlusExists && matched && !commonsPlus.commons.hidden;
   const notallowed = commonsPlusExists && !matched;
-  const hidden = commonsPlusExists && commonsPlus.commons.hidden;
+  const hidden = true;
 
   // Stryker disable all
killedBy: PlayPage tests renders without crashing
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>
  This commons has been hidden by the site administrator.
</h1> instead

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:176:12
     >
       <BasicLayout>
         <Container>
-          {!commonsPlus && <h1>This commons does not exist!</h1>}
+          {!commonsPlus || <h1>This commons does not exist!</h1>}
           {notallowed && <h1>You have yet to join this commons!</h1>}
           {hidden && (
killedBy: PlayPage tests click buy button
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>
  This commons does not exist!
</h1> instead

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:178:12
         <Container>
           {!commonsPlus && <h1>This commons does not exist!</h1>}
           {notallowed && <h1>You have yet to join this commons!</h1>}
-          {hidden && (
-            <h1>This commons has been hidden by the site administrator.</h1>
-          )}
+          {true}
           {allowed && !!currentUser && (
             <CommonsPlay currentUser={currentUser} />
killedBy: PlayPage tests cannot join hidden commons
statusReason: Unable to find an element with the text: This commons has been hidden by the site administrator.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; bac

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:178:12
         <Container>
           {!commonsPlus && <h1>This commons does not exist!</h1>}
           {notallowed && <h1>You have yet to join this commons!</h1>}
-          {hidden && (
-            <h1>This commons has been hidden by the site administrator.</h1>
-          )}
+          {hidden || <h1>This commons has been hidden by the site administrator.</h1>}
           {allowed && !!currentUser && (
             <CommonsPlay currentUser={currentUser} />
killedBy: PlayPage tests renders without crashing
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>
  This commons has been hidden by the site administrator.
</h1> instead

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:181:12
           {hidden && (
             <h1>This commons has been hidden by the site administrator.</h1>
           )}
-          {allowed && !!currentUser && (
-            <CommonsPlay currentUser={currentUser} />
-          )}
+          {false}
 
           {allowed && !!commonsPlus && (
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="commonsPlay-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(\"/src/assets/PlayPageBackground.jpg\");"

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:181:12
           {hidden && (
             <h1>This commons has been hidden by the site administrator.</h1>
           )}
-          {allowed && !!currentUser && (
-            <CommonsPlay currentUser={currentUser} />
-          )}
+          {allowed && !!currentUser || <CommonsPlay currentUser={currentUser} />}
 
           {allowed && !!commonsPlus && (
killedBy: PlayPage tests cannot join hidden commons
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1
  class="animate-charcter"
  data-testid="commonsPlay-title"
>
  Your farmstead awaits farmer

[Killed] BooleanLiteral
src/main/pages/PlayPage.jsx:185:23
             <CommonsPlay currentUser={currentUser} />
           )}
 
-          {allowed && !!commonsPlus && (
+          {allowed && !commonsPlus && (
             <CommonsOverview
               commonsPlus={commonsPlus}
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="CommonsOverview"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(\"/src/assets/PlayPageBackground.jpg\");"

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:192:12
             />
           )}
           <br />
-          {allowed && !!userCommons && !!commonsPlus && (
+          {allowed && !!userCommons || !!commonsPlus && (
             <CardGroup>
               <ManageCows
killedBy: PlayPage tests cannot join hidden commons
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="card"
  data-testid="ManageCows"
>
  <h5
    class="woodenboardtable card-header"

[Killed] BooleanLiteral
src/main/pages/PlayPage.jsx:192:41
             />
           )}
           <br />
-          {allowed && !!userCommons && !!commonsPlus && (
+          {allowed && !!userCommons && !commonsPlus && (
             <CardGroup>
               <ManageCows
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="ManageCows"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(\"/src/assets/PlayPageBackground.jpg\");"

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:216:8
           )}
         </Container>
       </BasicLayout>
-      {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (allowed && !!commonsPlus && commonsPlus.commons.showChat)) && (
-        <div style={chatContainerStyle} data-testid="playpage-chat-div">
-          {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
-          <Button
-            style={chatButtonStyle}
-            onClick={toggleChatWindow}
-            data-testid="playpage-chat-toggle"
-          >
-            {isChatOpen ? (
-              <span style={emojiStyle} data-testid="close-icon">
-                ❌
-              </span>
-            ) : (
-              <span style={emojiStyle} data-testid="message-icon">
-                💬
-              </span>
-            )}
-          </Button>
-        </div>
-      )}
+      {hasRole(currentUser, "ROLE_ADMIN") || allowed && !!commonsPlus && commonsPlus.commons.showChat || <div style={chatContainerStyle} data-testid="playpage-chat-div">
+          {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
+          <Button style={chatButtonStyle} onClick={toggleChatWindow} data-testid="playpage-chat-toggle">
+            {isChatOpen ? <span style={emojiStyle} data-testid="close-icon">
+                ❌
+              </span> : <span style={emojiStyle} data-testid="message-icon">
+                💬
+              </span>}
+          </Button>
+        </div>}
     </div>
   );
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="playpage-chat-div"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(\"/src/assets/PlayPageBackground.jpg\");"

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:216:8
           )}
         </Container>
       </BasicLayout>
-      {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (allowed && !!commonsPlus && commonsPlus.commons.showChat)) && (
-        <div style={chatContainerStyle} data-testid="playpage-chat-div">
-          {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
-          <Button
-            style={chatButtonStyle}
-            onClick={toggleChatWindow}
-            data-testid="playpage-chat-toggle"
-          >
-            {isChatOpen ? (
-              <span style={emojiStyle} data-testid="close-icon">
-                ❌
-              </span>
-            ) : (
-              <span style={emojiStyle} data-testid="message-icon">
-                💬
-              </span>
-            )}
-          </Button>
-        </div>
-      )}
+      {false}
     </div>
   );
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="playpage-chat-div"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(\"/src/assets/PlayPageBackground.jpg\");"

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:217:10
         </Container>
       </BasicLayout>
       {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (allowed && !!commonsPlus && commonsPlus.commons.showChat)) && (
+        (allowed && !!commonsPlus || commonsPlus.commons.showChat)) && (
         <div style={chatContainerStyle} data-testid="playpage-chat-div">
           {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
killedBy: PlayPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'commons')

[Killed] BooleanLiteral
src/main/pages/PlayPage.jsx:217:22
         </Container>
       </BasicLayout>
       {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (allowed && !!commonsPlus && commonsPlus.commons.showChat)) && (
+        (allowed && !commonsPlus && commonsPlus.commons.showChat)) && (
         <div style={chatContainerStyle} data-testid="playpage-chat-div">
           {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="playpage-chat-div"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(\"/src/assets/PlayPageBackground.jpg\");"
