[Killed] ConditionalExpression
main/components/Commons/AdminCommonsCard.jsx:14:7
   const [showModal, setShowModal] = useState(false);
   const [isHovered, setIsHovered] = useState(false);
 
-  if (!hasRole(currentUser, "ROLE_ADMIN")) {
+  if (false) {
     return null;
   }
killedBy: AdminCommonsCard tests returns null for non-admin user
statusReason: expected <div …(3)>…(1)</div> to be null

[Killed] BooleanLiteral
main/components/Commons/AdminCommonsCard.jsx:14:7
   const [showModal, setShowModal] = useState(false);
   const [isHovered, setIsHovered] = useState(false);
 
-  if (!hasRole(currentUser, "ROLE_ADMIN")) {
+  if (hasRole(currentUser, "ROLE_ADMIN")) {
     return null;
   }
killedBy: AdminCommonsCard tests renders without crashing for admin user
statusReason: Unable to find an element by: [data-testid="AdminCommonsCard-1"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
main/components/Commons/AdminCommonsCard.jsx:32:28
     navigate(`/leaderboard/${commons.id}`);
   };
 
-  const handleChat = () => {
-    navigate(`/admin/chat/${commons.id}`);
-  };
+  const handleChat = () => {};
 
   const deleteMutation = useBackendMutation(
killedBy: AdminCommonsCard tests clicking Chat button navigates to admin chat page
statusReason: expected "spy" to be called with arguments: [ '/admin/chat/1' ]

Number of calls: 0

[Killed] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:33:14
   };
 
   const handleChat = () => {
-    navigate(`/admin/chat/${commons.id}`);
+    navigate(``);
   };
 
killedBy: AdminCommonsCard tests clicking Chat button navigates to admin chat page
statusReason: expected "spy" to be called with arguments: [ '/admin/chat/1' ]

Received: 

  1st spy call:

  [
-   "/admin/chat/1",

[Killed] ArrowFunction
main/components/Commons/AdminCommonsCard.jsx:37:5
   };
 
   const deleteMutation = useBackendMutation(
-    (id) => ({
-      url: "/api/commons",
-      method: "DELETE",
-      params: { id },
-    }),
+    () => undefined,
     { onSuccess: onDeleteSuccess },
     ["/api/commons/allplus"],
killedBy: AdminCommonsCard tests modal delete button confirms deletion
statusReason: expected "spy" to be called with arguments: [ 'Commons with id 1 was deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/Commons/AdminCommonsCard.jsx:37:14
   };
 
   const deleteMutation = useBackendMutation(
-    (id) => ({
-      url: "/api/commons",
-      method: "DELETE",
-      params: { id },
-    }),
+    (id) => ({}),
     { onSuccess: onDeleteSuccess },
     ["/api/commons/allplus"],
killedBy: AdminCommonsCard tests modal delete button confirms deletion
statusReason: expected "spy" to be called with arguments: [ 'Commons with id 1 was deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Commons/AdminCommonsCard.jsx:46:31
     ["/api/commons/allplus"],
   );
 
-  const confirmDelete = () => {
-    deleteMutation.mutate(commons.id);
-    setShowModal(false);
-  };
+  const confirmDelete = () => {};
 
   const formatDate = (dateString) => {
killedBy: AdminCommonsCard tests modal delete button confirms deletion
statusReason: expected "spy" to be called with arguments: [ 'Commons with id 1 was deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
main/components/Commons/AdminCommonsCard.jsx:48:18
 
   const confirmDelete = () => {
     deleteMutation.mutate(commons.id);
-    setShowModal(false);
+    setShowModal(true);
   };
 
killedBy: AdminCommonsCard tests modal delete button confirms deletion
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog"
  data-testid="AdminCommonsCard-Modal-1"
>
  <div
    class="modal-content"

[Killed] ArrowFunction
main/components/Commons/AdminCommonsCard.jsx:55:23
     return String(dateString).slice(0, 10);
   };
 
-  const renderField = (label, value) => (
-    <Row className="mb-2">
-      <Col sm={6}>
-        <strong>{label}:</strong>
-      </Col>
-      <Col sm={6}>{value}</Col>
-    </Row>
-  );
+  const renderField = () => undefined;
 
   const deleteModal = (
killedBy: AdminCommonsCard tests displays all commons fields correctly
statusReason: Unable to find an element with the text: Cow Price:. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="mb-3 card"
      data-testid="AdminCommonsCard-1"

[Killed] BooleanLiteral
main/components/Commons/AdminCommonsCard.jsx:108:42
             ? "0 4px 8px rgba(0,0,0,0.17)"
             : "0 2px 4px rgba(0,0,0,0.1)",
         }}
-        onMouseEnter={() => setIsHovered(true)}
+        onMouseEnter={() => setIsHovered(false)}
         onMouseLeave={() => setIsHovered(false)}
       >
killedBy: AdminCommonsCard tests card has hover state
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- boxShadow: 0 4px 8px rgba(0,0,0,0.17);

[Killed] ArrowFunction
main/components/Commons/AdminCommonsCard.jsx:108:23
             ? "0 4px 8px rgba(0,0,0,0.17)"
             : "0 2px 4px rgba(0,0,0,0.1)",
         }}
-        onMouseEnter={() => setIsHovered(true)}
+        onMouseEnter={() => undefined}
         onMouseLeave={() => setIsHovered(false)}
       >
killedBy: AdminCommonsCard tests card has hover state
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- boxShadow: 0 4px 8px rgba(0,0,0,0.17);

[Killed] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:117:24
           </Card.Title>
 
           {renderField("Cow Price", commons.cowPrice)}
-          {renderField("Milk Price", commons.milkPrice)}
+          {renderField("", commons.milkPrice)}
           {renderField("Start Balance", commons.startingBalance)}
           {renderField("Starting Date", formatDate(commons.startingDate))}
killedBy: AdminCommonsCard tests displays all commons fields correctly
statusReason: Unable to find an element with the text: Milk Price:. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="mb-3 card"
      data-testid="AdminCommonsCard-1"

[Killed] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:118:24
 
           {renderField("Cow Price", commons.cowPrice)}
           {renderField("Milk Price", commons.milkPrice)}
-          {renderField("Start Balance", commons.startingBalance)}
+          {renderField("", commons.startingBalance)}
           {renderField("Starting Date", formatDate(commons.startingDate))}
           {renderField("Last Date", formatDate(commons.lastDate))}
killedBy: AdminCommonsCard tests displays all commons fields correctly
statusReason: Unable to find an element with the text: Start Balance:. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="mb-3 card"
      data-testid="AdminCommonsCard-1"

[Killed] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:119:24
           {renderField("Cow Price", commons.cowPrice)}
           {renderField("Milk Price", commons.milkPrice)}
           {renderField("Start Balance", commons.startingBalance)}
-          {renderField("Starting Date", formatDate(commons.startingDate))}
+          {renderField("", formatDate(commons.startingDate))}
           {renderField("Last Date", formatDate(commons.lastDate))}
           {renderField("Degrad Rate", commons.degradationRate)}
killedBy: AdminCommonsCard tests displays all commons fields correctly
statusReason: Unable to find an element with the text: Starting Date:. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="mb-3 card"
      data-testid="AdminCommonsCard-1"

[Killed] ConditionalExpression
main/components/Commons/AdminCommonsCard.jsx:124:38
           {renderField("Degrad Rate", commons.degradationRate)}
           {renderField("Show Leaderboard", String(commons.showLeaderboard))}
           {renderField("Show Chat", String(commons.showChat))}
-          {renderField("Total Cows", commonItem.totalCows || 0)}
+          {renderField("Total Cows", true)}
           {renderField("Cap / User", commons.capacityPerUser)}
           {renderField("Carry Cap", commons.carryingCapacity)}
killedBy: AdminCommonsCard tests displays all commons fields correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  10
Received:

[Killed] ConditionalExpression
main/components/Commons/AdminCommonsCard.jsx:124:38
           {renderField("Degrad Rate", commons.degradationRate)}
           {renderField("Show Leaderboard", String(commons.showLeaderboard))}
           {renderField("Show Chat", String(commons.showChat))}
-          {renderField("Total Cows", commonItem.totalCows || 0)}
+          {renderField("Total Cows", false)}
           {renderField("Cap / User", commons.capacityPerUser)}
           {renderField("Carry Cap", commons.carryingCapacity)}
killedBy: AdminCommonsCard tests displays all commons fields correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  10
Received:

[Killed] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:125:24
           {renderField("Show Leaderboard", String(commons.showLeaderboard))}
           {renderField("Show Chat", String(commons.showChat))}
           {renderField("Total Cows", commonItem.totalCows || 0)}
-          {renderField("Cap / User", commons.capacityPerUser)}
+          {renderField("", commons.capacityPerUser)}
           {renderField("Carry Cap", commons.carryingCapacity)}
           {renderField("Eff Cap", commonItem.effectiveCapacity || 0)}
killedBy: AdminCommonsCard tests displays all commons fields correctly
statusReason: Unable to find an element with the text: Cap / User:. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="mb-3 card"
      data-testid="AdminCommonsCard-1"

[Killed] LogicalOperator
main/components/Commons/AdminCommonsCard.jsx:127:35
           {renderField("Total Cows", commonItem.totalCows || 0)}
           {renderField("Cap / User", commons.capacityPerUser)}
           {renderField("Carry Cap", commons.carryingCapacity)}
-          {renderField("Eff Cap", commonItem.effectiveCapacity || 0)}
+          {renderField("Eff Cap", commonItem.effectiveCapacity && 0)}
 
           <hr />
killedBy: AdminCommonsCard tests displays all commons fields correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100
Received:
  0

[Killed] ConditionalExpression
main/components/Commons/AdminCommonsCard.jsx:127:35
           {renderField("Total Cows", commonItem.totalCows || 0)}
           {renderField("Cap / User", commons.capacityPerUser)}
           {renderField("Carry Cap", commons.carryingCapacity)}
-          {renderField("Eff Cap", commonItem.effectiveCapacity || 0)}
+          {renderField("Eff Cap", false)}
 
           <hr />
killedBy: AdminCommonsCard tests displays all commons fields correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100
Received:

[Killed] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:189:21
             <Button
               variant="info"
               size="sm"
-              href={`/admin/dashboard/${commons.id}`}
+              href={``}
               data-testid={`AdminCommonsCard-Dashboard-${commons.id}`}
             >
killedBy: AdminCommonsCard tests dashboard button has correct href and testid
statusReason: expect(element).toHaveAttribute("href", "/admin/dashboard/1") // element.getAttribute("href") === "/admin/dashboard/1"

Expected the element to have attribute:
  href="/admin/dashboard/1"
Received:
  href=""
