[Killed] BooleanLiteral
main/components/Commons/CommonStatsCharts.jsx:16:41
 } from "recharts";
 
 export default function CommonStatsCharts({ data, histogramData }) {
-  const healthData = data.filter((d) => !isNaN(Number(d.avgHealth)));
+  const healthData = data.filter((d) => isNaN(Number(d.avgHealth)));
 
   const histogramChartData = histogramData.map((userCommons) => ({
killedBy: CommonStatsCharts tests renders charts with filtered and mapped data
statusReason: expected '[{"id":2,"numCows":20,"avgHealth":"Na…' not to contain 'NaN'

[Killed] MethodExpression
main/components/Commons/CommonStatsCharts.jsx:16:22
 } from "recharts";
 
 export default function CommonStatsCharts({ data, histogramData }) {
-  const healthData = data.filter((d) => !isNaN(Number(d.avgHealth)));
+  const healthData = data;
 
   const histogramChartData = histogramData.map((userCommons) => ({
killedBy: CommonStatsCharts tests renders charts with filtered and mapped data
statusReason: expected '[{"id":1,"numCows":10,"avgHealth":100…' not to contain 'NaN'

[Killed] ArrowFunction
main/components/Commons/CommonStatsCharts.jsx:18:48
 export default function CommonStatsCharts({ data, histogramData }) {
   const healthData = data.filter((d) => !isNaN(Number(d.avgHealth)));
 
-  const histogramChartData = histogramData.map((userCommons) => ({
-    username: userCommons.username,
-    numOfCows: userCommons.numOfCows,
-  }));
+  const histogramChartData = histogramData.map(() => undefined);
 
   return (
killedBy: CommonStatsCharts tests renders charts with filtered and mapped data
statusReason: Unable to find an element with the text: /farmer1/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h3>
        Cow Ownership Histogram
