[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:27:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/admin/editcommons/${cell.row.values["commons.id"]}`);
+    navigate(``);
   };
 
killedBy: UserTable tests Edit button navigates to edit commons page
statusReason: expected "spy" to be called with arguments: [ '/admin/editcommons/1' ]

Received: 

  1st spy call:

  [
-   "/admin/editcommons/1",

[Killed] BlockStatement
main/components/Commons/CommonsTable.jsx:36:36
     ["/api/commons/allplus"],
   );
 
-  const deleteCallback = (cell) => {
-    setCellToDelete(cell);
-    setShowModal(true);
-  };
+  const deleteCallback = (cell) => {};
 
   const leaderboardCallback = (cell) => {
killedBy: Modal tests Clicking Delete button opens the modal for adminUser
statusReason: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/Commons/CommonsTable.jsx:48:17
   const columns = [
     {
       Header: "id",
-      accessor: (row) => row.commons.id,
+      accessor: () => undefined,
       id: "commons.id",
     },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:

[Killed] ArrowFunction
main/components/Commons/CommonsTable.jsx:53:17
     },
     {
       Header: "Name",
-      accessor: (row) => row.commons.name,
+      accessor: () => undefined,
       id: "commons.name",
     },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Com2
Received:

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:54:11
     {
       Header: "Name",
       accessor: (row) => row.commons.name,
-      id: "commons.name",
+      id: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="CommonsTable-cell-row-1-col-commons.name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.jsx:66:5
       accessor: (row) => row.commons.milkPrice,
       id: "commons.milkPrice",
     },
-    {
-      Header: (
-        <span>
-          Start <br /> Bal
-        </span>
-      ),
-      accessor: (row) => row.commons.startingBalance,
-      id: "commons.startingBalance",
-    },
+    {},
     {
       Header: (
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:82:11
         </span>
       ),
       accessor: (row) => String(row.commons.startingDate).slice(0, 10),
-      id: "commons.startingDate",
+      id: "",
     },
     {
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/CommonsTable.jsx:108:17
           Show <br /> LrdrBrd?
         </span>
       ),
-      accessor: (row) => String(row.commons.showLeaderboard),
+      accessor: () => undefined,
       id: "commons.showLeaderboard",
     },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:

[Killed] ArrowFunction
main/components/Commons/CommonsTable.jsx:117:17
           Show <br /> Chat?
         </span>
       ),
-      accessor: (row) => String(row.commons.showChat),
+      accessor: () => undefined,
       id: "commons.showChat",
     },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:118:11
         </span>
       ),
       accessor: (row) => String(row.commons.showChat),
-      id: "commons.showChat",
+      id: "",
     },
     {
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.jsx:120:5
       accessor: (row) => String(row.commons.showChat),
       id: "commons.showChat",
     },
-    {
-      Header: (
-        <span>
-          Tot <br /> Cows
-        </span>
-      ),
-      accessor: "totalCows",
-    },
+    {},
     {
       Header: (
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:144:11
         </span>
       ),
       accessor: (row) => row.commons.carryingCapacity,
-      id: "commons.carryingCapacity",
+      id: "",
     },
     {
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:169:22
       `/api/commonstats/download?commonsId=`,
       testid,
     ),
-    HrefButtonColumn("Announcements", "info", `/admin/announcements/`, testid),
+    HrefButtonColumn("", "info", `/admin/announcements/`, testid),
     HrefButtonColumn("Chat", "primary", `/admin/chat/`, testid),
     HrefButtonColumn("Dashboard", "info", `/admin/dashboard/`, testid),
killedBy: UserTable tests renders without crashing for empty table for admin
statusReason: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Commons/CommonsTable.jsx:202:26
         <Button
           variant="danger"
           data-testid="CommonsTable-Modal-Delete"
-          onClick={() => {
-            deleteMutation.mutate(cellToDelete);
-            setShowModal(false);
-          }}
+          onClick={() => {}}
         >
           Permanently Delete
killedBy: Modal tests Clicking Permanently Delete button deletes the commons
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
main/components/Commons/CommonsTable.jsx:204:26
           data-testid="CommonsTable-Modal-Delete"
           onClick={() => {
             deleteMutation.mutate(cellToDelete);
-            setShowModal(false);
+            setShowModal(true);
           }}
         >
killedBy: Modal tests Clicking Permanently Delete button deletes the commons
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style
