[Killed] BlockStatement
src/main/pages/AdminChatPage.jsx:40:54
       }, {})
     : {};
 
-  const fetchChatPage = async ({ pageParam = 0 }) => {
-    const response = await axios.get("/api/chat/admin/get", {
-      params: {
-        commonsId: commonsId,
-        page: pageParam,
-        size: PAGE_SIZE,
-      },
-    });
-    return response.data;
-  };
+  const fetchChatPage = async ({ pageParam = 0 }) => {};
 
   const {
killedBy: AdminChatPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
src/main/pages/AdminChatPage.jsx:58:72
     hasNextPage,
     isFetching,
     isFetchingNextPage,
-  } = useInfiniteQuery(["adminChatHistory", commonsId], fetchChatPage, {
-    getNextPageParam: (lastPage, pages) =>
-      lastPage?.last === false ? pages.length : undefined,
-    refetchInterval: REFRESH_RATE,
-    enabled: !!commonsId,
-  });
+  } = useInfiniteQuery(["adminChatHistory", commonsId], fetchChatPage, {});
 
   useEffect(() => {
killedBy: AdminChatPage configures chat query key, pagination logic, and polling options
statusReason: expected undefined to be true // Object.is equality

[Killed] StringLiteral
src/main/pages/AdminChatPage.jsx:58:25
     hasNextPage,
     isFetching,
     isFetchingNextPage,
-  } = useInfiniteQuery(["adminChatHistory", commonsId], fetchChatPage, {
+  } = useInfiniteQuery(["", commonsId], fetchChatPage, {
     getNextPageParam: (lastPage, pages) =>
       lastPage?.last === false ? pages.length : undefined,
killedBy: AdminChatPage uses admin endpoint /api/chat/admin/get
statusReason: expected [ '', 1 ] to deeply equal [ 'adminChatHistory', 1 ]

[Killed] ArrowFunction
src/main/pages/AdminChatPage.jsx:59:23
     isFetching,
     isFetchingNextPage,
   } = useInfiniteQuery(["adminChatHistory", commonsId], fetchChatPage, {
-    getNextPageParam: (lastPage, pages) =>
-      lastPage?.last === false ? pages.length : undefined,
+    getNextPageParam: () => undefined,
     refetchInterval: REFRESH_RATE,
     enabled: !!commonsId,
killedBy: AdminChatPage configures chat query key, pagination logic, and polling options
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ConditionalExpression
src/main/pages/AdminChatPage.jsx:60:7
     isFetchingNextPage,
   } = useInfiniteQuery(["adminChatHistory", commonsId], fetchChatPage, {
     getNextPageParam: (lastPage, pages) =>
-      lastPage?.last === false ? pages.length : undefined,
+      true ? pages.length : undefined,
     refetchInterval: REFRESH_RATE,
     enabled: !!commonsId,
killedBy: AdminChatPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element with the text: [no more messages]. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/AdminChatPage.jsx:66:9
   });
 
   useEffect(() => {
-    if (!hasNextPage) {
+    if (false) {
       return;
     }
killedBy: AdminChatPage does not register an observer when there are no additional pages
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      [Function anonymous],

[Killed] LogicalOperator
src/main/pages/AdminChatPage.jsx:72:13
 
     const observer = new IntersectionObserver(
       (entries) => {
-        if (entries[0].isIntersecting && hasNextPage && !isFetchingNextPage) {
+        if (entries[0].isIntersecting || hasNextPage && !isFetchingNextPage) {
           fetchNextPage();
         }
killedBy: AdminChatPage does not fetch next page when observer entry is not intersecting
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array []

[Killed] ConditionalExpression
src/main/pages/AdminChatPage.jsx:91:13
 
   const messages = Array.isArray(data?.pages)
     ? data.pages.flatMap((page) => {
-        if (!page || !Array.isArray(page.content)) {
+        if (true) {
           return [];
         }
killedBy: AdminChatPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
src/main/pages/AdminChatPage.jsx:94:47
         if (!page || !Array.isArray(page.content)) {
           return [];
         }
-        return page.content.map((message) => ({
-          ...message,
-          username: userIdToUsername[message.userId],
-        }));
+        return page.content.map((message) => ({}));
       })
     : [];
killedBy: AdminChatPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/AdminChatPage.jsx:123:24
           style={{
             minHeight: "50vh",
             maxHeight: "70vh",
-            overflowY: "auto",
+            overflowY: "",
             border: "1px solid #dee2e6",
             borderRadius: "0.5rem",
killedBy: AdminChatPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- overflow-y: auto;

[Killed] StringLiteral
src/main/pages/AdminChatPage.jsx:124:21
             minHeight: "50vh",
             maxHeight: "70vh",
             overflowY: "auto",
-            border: "1px solid #dee2e6",
+            border: "",
             borderRadius: "0.5rem",
             padding: "1rem",
killedBy: AdminChatPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- border: 1px solid rgb(222, 226, 230);

[Killed] StringLiteral
src/main/pages/AdminChatPage.jsx:126:22
             overflowY: "auto",
             border: "1px solid #dee2e6",
             borderRadius: "0.5rem",
-            padding: "1rem",
+            padding: "",
             backgroundColor: "white",
           }}
killedBy: AdminChatPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- padding: 1rem;

[Killed] ConditionalExpression
src/main/pages/AdminChatPage.jsx:131:12
           }}
           data-testid="AdminChatPage-message-container"
         >
-          {isInitialLoading && (
-            <div className="text-center my-3">
-              <Spinner animation="border" role="status" size="sm" /> Loading
-              messages...
-            </div>
-          )}
+          {true}
           {showError && (
             <div className="text-center text-danger my-3">
killedBy: AdminChatPage shows loading indicator while initial messages fetch
statusReason: Unable to find an element with the text: /Loading messages.../i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
src/main/pages/AdminChatPage.jsx:142:12
               Unable to load chat messages.
             </div>
           )}
-          {!isInitialLoading && messages.length === 0 && (
+          {isInitialLoading && messages.length === 0 && (
             <div className="text-center text-muted my-3">
               No messages available for this commons.
killedBy: AdminChatPage shows empty state when there are no messages after loading
statusReason: Unable to find an element with the text: /No messages available for this commons/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/AdminChatPage.jsx:142:12
               Unable to load chat messages.
             </div>
           )}
-          {!isInitialLoading && messages.length === 0 && (
-            <div className="text-center text-muted my-3">
-              No messages available for this commons.
-            </div>
-          )}
+          {!isInitialLoading && messages.length === 0 || <div className="text-center text-muted my-3">
+              No messages available for this commons.
+            </div>}
           {messages.map((message) => (
             <ChatMessageDisplay key={message.id} message={message} />
killedBy: AdminChatPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="text-center text-muted my-3"
>
  No messages available for this commons.
</div> instead

[Killed] LogicalOperator
src/main/pages/AdminChatPage.jsx:162:10
                 : "[no more messages]"}
           </div>
         </div>
-        {isFetching && !isFetchingNextPage && (
+        {isFetching || !isFetchingNextPage && (
           <div className="text-center text-muted mt-2">
             Updating conversation...
killedBy: AdminChatPage does not show updating indicator when not fetching
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="text-center text-muted mt-2"
>
  Updating conversation...
</div> instead
