[Killed] ArrayDeclaration
src/main/pages/AdminDashboardPage.jsx:11:5
   const { id } = useParams();
 
   const { data: commonStats } = useBackend(
-    [`/api/commonstats/commons?commonsId=${id}`],
+    [],
     {
       method: "GET",
killedBy: AdminDashboardPage tests renders dashboard and calls backend with correct endpoints
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received: 

  1st useBackend call:

@@ -1,9 +1,7 @@
  [

[Killed] StringLiteral
src/main/pages/AdminDashboardPage.jsx:23:6
   );
 
   const { data: histogramData } = useBackend(
-    [`/api/dashboard/histogram/${id}`],
+    [``],
     {
       method: "GET",
killedBy: AdminDashboardPage tests renders dashboard and calls backend with correct endpoints
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received: 

  1st useBackend call:

  [
    [
