[Killed] ObjectLiteral
main/components/Courses/CoursesForm.jsx:45:32
           id="code"
           type="text"
           isInvalid={Boolean(errors.code)}
-          {...register("code", {
-            required: "Course code is required.",
-          })}
+          {...register("code", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Course code is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Courses/CoursesForm.jsx:78:23
           type="text"
           isInvalid={Boolean(errors.term)}
           {...register("term", {
-            required: "Course term is required.",
+            required: "",
           })}
         />
killedBy: CoursesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Course term is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
