[Killed] ArrowFunction
src/main/pages/AdminCoursesCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function CoursesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (course) => ({
-    url: "/api/course",
-    method: "POST",
-    params: {
-      code: course.code,
-      name: course.name,
-      term: course.term,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (course) => {
killedBy: CoursesCreatePage tests on submit, makes request to backend, and redirects to /course
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminCoursesCreatePage.jsx:8:44
 import { toast } from "react-toastify";
 
 export default function CoursesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (course) => ({
-    url: "/api/course",
-    method: "POST",
-    params: {
-      code: course.code,
-      name: course.name,
-      term: course.term,
-    },
-  });
+  const objectToAxiosParams = (course) => ({});
 
   const onSuccess = (course) => {
killedBy: CoursesCreatePage tests on submit, makes request to backend, and redirects to /course
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminCoursesCreatePage.jsx:11:13
   const objectToAxiosParams = (course) => ({
     url: "/api/course",
     method: "POST",
-    params: {
-      code: course.code,
-      name: course.name,
-      term: course.term,
-    },
+    params: {},
   });
 
killedBy: CoursesCreatePage tests on submit, makes request to backend, and redirects to /course
statusReason: expected {} to deeply equal { code: 'MATH 4A', …(2) }

[Killed] BlockStatement
src/main/pages/AdminCoursesCreatePage.jsx:18:33
     },
   });
 
-  const onSuccess = (course) => {
-    toast(`New Course Created - id: ${course.id} code: ${course.code}`);
-  };
+  const onSuccess = (course) => {};
 
   const mutation = useBackendMutation(
killedBy: CoursesCreatePage tests on submit, makes request to backend, and redirects to /course
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
src/main/pages/AdminCoursesCreatePage.jsx:35:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/admin/listcourses" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: CoursesCreatePage tests on submit, makes request to backend, and redirects to /course
statusReason: expected "spy" to be called with arguments: [ { to: '/admin/listcourses' } ]

Number of calls: 0
