[Killed] ObjectLiteral
src/main/pages/AdminCoursesEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/course?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/course/${id}`,
-    },
+    {},
   );
 
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="CoursesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/AdminCoursesEditPage.jsx:21:12
     {
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
-      url: `/api/course/${id}`,
+      url: ``,
     },
   );
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="CoursesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
src/main/pages/AdminCoursesEditPage.jsx:25:34
     },
   );
 
-  const objectToAxiosPutParams = (course) => ({
-    url: `/api/course/${course.id}`,
-    method: "PUT",
-    data: {
-      code: course.code,
-      name: course.name,
-      term: course.term,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (course) => {
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminCoursesEditPage.jsx:28:11
   const objectToAxiosPutParams = (course) => ({
     url: `/api/course/${course.id}`,
     method: "PUT",
-    data: {
-      code: course.code,
-      name: course.name,
-      term: course.term,
-    },
+    data: {},
   });
 
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected '{}' to be '{"code":"MATH 4B","name":"Differentia…' // Object.is equality

[Killed] BlockStatement
src/main/pages/AdminCoursesEditPage.jsx:35:33
     },
   });
 
-  const onSuccess = (course) => {
-    toast(`Course Updated - id: ${course.id} code: ${course.code}`);
-  };
+  const onSuccess = (course) => {};
 
   const mutation = useBackendMutation(
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/main/pages/AdminCoursesEditPage.jsx:60:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Course</h1>
-        {course && (
-          <CoursesForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={course}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="CoursesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/AdminCoursesEditPage.jsx:60:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Course</h1>
-        {course && (
-          <CoursesForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={course}
-          />
-        )}
+        {course || <CoursesForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={course} />}
       </div>
     </BasicLayout>
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="CoursesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
