[Killed] ObjectLiteral
src/main/pages/AdminCoursesIndexPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/course/all"],
-    { url: "/api/course/all" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: CoursesIndexPage tests renders three courses correctly for regular user
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
src/main/pages/AdminCoursesIndexPage.jsx:23:30
     [],
   );
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/admin/createcourses"
-          style={{ float: "right" }}
-        >
-          Create Course
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   return (
killedBy: CoursesIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create Course/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
src/main/pages/AdminCoursesIndexPage.jsx:29:18
         <Button
           variant="primary"
           href="/admin/createcourses"
-          style={{ float: "right" }}
+          style={{}}
         >
           Create Course
killedBy: CoursesIndexPage tests Renders with Create Button for admin user
statusReason: expected '' to be 'right' // Object.is equality

[Killed] StringLiteral
src/main/pages/AdminCoursesIndexPage.jsx:29:27
         <Button
           variant="primary"
           href="/admin/createcourses"
-          style={{ float: "right" }}
+          style={{ float: "" }}
         >
           Create Course
killedBy: CoursesIndexPage tests Renders with Create Button for admin user
statusReason: expected '' to be 'right' // Object.is equality
