[Killed] BlockStatement
src/main/utils/courseUtils.js:3:42
 import { toast } from "react-toastify";
 
-export function onDeleteSuccess(message) {
-  toast(message.message);
-}
+export function onDeleteSuccess(message) {}
 
 export function cellToAxiosParamsDelete(cell) {
killedBy: CoursesIndexPage tests what happens when you click delete, admin
statusReason: expected "spy" to be called with arguments: [ 'Course deleted!' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/main/utils/courseUtils.js:7:47
   toast(message.message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: `/api/course/${cell.row.values.id}`,
-    method: "DELETE",
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: CoursesIndexPage tests what happens when you click delete, admin
statusReason: expected "spy" to be called with arguments: [ 'Course deleted!' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
src/main/utils/courseUtils.js:8:10
 }
 
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: `/api/course/${cell.row.values.id}`,
-    method: "DELETE",
-  };
+  return {};
 }
 
killedBy: CoursesIndexPage tests what happens when you click delete, admin
statusReason: expected "spy" to be called with arguments: [ 'Course deleted!' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/main/utils/courseUtils.js:10:13
 export function cellToAxiosParamsDelete(cell) {
   return {
     url: `/api/course/${cell.row.values.id}`,
-    method: "DELETE",
+    method: "",
   };
 }
killedBy: CoursesIndexPage tests what happens when you click delete, admin
statusReason: expected "spy" to be called with arguments: [ 'Course deleted!' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />
